Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.GetCurveLoop
Gets the CurveLoop representing the base profile curve loop of the roof or floor slab
Returns:
The CurveLoop.
Since:
2016

Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.GetPlane
Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab.
Returns:
The plane.
Since:
2016

Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.AreaOfCurveLoop
The area of the CurveLoop of the roof or floor slab.
Since:
2016

Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.LoopFace
The face of the loops of the roof or floor slab.
Since:
2016

Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.Depth
The depth of the roof or floor slab.
Remarks:
The depth is the thickness of the slab as measured perpendicular to the slab's main faces,
as opposed to the vertical extrusion distance.
Since:
2016

Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo
A class that contains roof or floor slab information, calculated by ExporterIFCUtils.ComputeSubcomponents().
Remarks:
A slab is an extrusion with one outer and no inner base profile curve loops, created by
extruding the base profile loop in the direction Plane.Normal a distance given by the Depth value.
Since:
2016